; domain
(define (domain Perestroika)
(:requirements :typing :equality)
(:types location resource - object
        
)

(:predicates (at-agent ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (taken ?r - resource)
             (accessible ?l - location)
             (alive)
             (dead)
             (solid ?l - location)
             (big ?l - location)
             (medium ?l - location)
             (small ?l - location)
             (none ?l - location)   
             (act-round)

            ; (dup-accessible ?l - location)
)

(:action move
:parameters (?l1 ?l2 - location)
:precondition (and (at-agent ?l1)
                   (alive)
                   (connected ?l1 ?l2)
                   (accessible ?l2)
                  ; (dup-accessible ?l2)
              )
:effect (and (not (at-agent ?l1))
             (at-agent ?l2)
        )
)

(:action collect
:parameters (?r - resource ?l - location)
:precondition (and (at-agent ?l)
                   (at-res ?r ?l)
                   (alive)
              )
:effect (and (taken ?r)
        )
)


)

; problem
(define (problem Perestroika-problem)
(:domain Perestroika)
(:objects r1 r2 r3 r4 r5 r6 r7 r8 r9 r10 r11 r12 r13 r14 r15 r16 r17 r18 r19 r20 r21 r22 r23 r24 - resource
          l-1-1 l-1-2 l-1-3 l-1-4 l-1-5 l-1-6 l-1-7 l-1-8 l-1-9 l-2-1 l-2-2 l-2-3 l-2-4 l-2-5 l-2-6 l-2-7 l-2-8 l-2-9 l-3-1 l-3-2 l-3-3 l-3-4 l-3-5 l-3-6 l-3-7 l-3-8 l-3-9 l-4-1 l-4-2 l-4-3 l-4-4 l-4-5 l-4-6 l-4-7 l-4-8 l-4-9 l-5-1 l-5-2 l-5-3 l-5-4 l-5-5 l-5-6 l-5-7 l-5-8 l-5-9 l-6-1 l-6-2 l-6-3 l-6-4 l-6-5 l-6-6 l-6-7 l-6-8 l-6-9 l-7-1 l-7-2 l-7-3 l-7-4 l-7-5 l-7-6 l-7-7 l-7-8 l-7-9 l-8-1 l-8-2 l-8-3 l-8-4 l-8-5 l-8-6 l-8-7 l-8-8 l-8-9 l-9-1 l-9-2 l-9-3 l-9-4 l-9-5 l-9-6 l-9-7 l-9-8 l-9-9 - location
)

(:init (act-round)
       (alive)
       (at-agent l-1-1)
       (at-res r1 l-1-3)
       (at-res r2 l-1-5)
       (at-res r3 l-1-7)
       (at-res r4 l-1-9)
       (at-res r5 l-3-1)
       (at-res r6 l-3-3)
       (at-res r7 l-3-5)
       (at-res r8 l-3-7)
       (at-res r9 l-3-9)
       (at-res r10 l-5-1)
       (at-res r11 l-5-3)
       (at-res r12 l-5-5)
       (at-res r13 l-5-7)
       (at-res r14 l-5-9)
       (at-res r15 l-7-1)
       (at-res r16 l-7-3)
       (at-res r17 l-7-5)
       (at-res r18 l-7-7)
       (at-res r19 l-7-9)
       (at-res r20 l-9-1)
       (at-res r21 l-9-3)
       (at-res r22 l-9-5)
       (at-res r23 l-9-7)
       (at-res r24 l-9-9)

(connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-1-3 l-1-4)
(connected l-1-4 l-1-3)
(connected l-1-4 l-2-4)
(connected l-2-4 l-1-4)
(connected l-1-4 l-1-5)
(connected l-1-5 l-1-4)
(connected l-1-5 l-2-5)
(connected l-2-5 l-1-5)
(connected l-1-5 l-1-6)
(connected l-1-6 l-1-5)
(connected l-1-6 l-2-6)
(connected l-2-6 l-1-6)
(connected l-1-6 l-1-7)
(connected l-1-7 l-1-6)
(connected l-1-7 l-2-7)
(connected l-2-7 l-1-7)
(connected l-1-7 l-1-8)
(connected l-1-8 l-1-7)
(connected l-1-8 l-2-8)
(connected l-2-8 l-1-8)
(connected l-1-8 l-1-9)
(connected l-1-9 l-1-8)
(connected l-1-9 l-2-9)
(connected l-2-9 l-1-9)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(connected l-2-3 l-2-4)
(connected l-2-4 l-2-3)
(connected l-2-4 l-3-4)
(connected l-3-4 l-2-4)
(connected l-2-4 l-2-5)
(connected l-2-5 l-2-4)
(connected l-2-5 l-3-5)
(connected l-3-5 l-2-5)
(connected l-2-5 l-2-6)
(connected l-2-6 l-2-5)
(connected l-2-6 l-3-6)
(connected l-3-6 l-2-6)
(connected l-2-6 l-2-7)
(connected l-2-7 l-2-6)
(connected l-2-7 l-3-7)
(connected l-3-7 l-2-7)
(connected l-2-7 l-2-8)
(connected l-2-8 l-2-7)
(connected l-2-8 l-3-8)
(connected l-3-8 l-2-8)
(connected l-2-8 l-2-9)
(connected l-2-9 l-2-8)
(connected l-2-9 l-3-9)
(connected l-3-9 l-2-9)
(connected l-3-1 l-4-1)
(connected l-4-1 l-3-1)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-3-2 l-4-2)
(connected l-4-2 l-3-2)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)
(connected l-3-3 l-4-3)
(connected l-4-3 l-3-3)
(connected l-3-3 l-3-4)
(connected l-3-4 l-3-3)
(connected l-3-4 l-4-4)
(connected l-4-4 l-3-4)
(connected l-3-4 l-3-5)
(connected l-3-5 l-3-4)
(connected l-3-5 l-4-5)
(connected l-4-5 l-3-5)
(connected l-3-5 l-3-6)
(connected l-3-6 l-3-5)
(connected l-3-6 l-4-6)
(connected l-4-6 l-3-6)
(connected l-3-6 l-3-7)
(connected l-3-7 l-3-6)
(connected l-3-7 l-4-7)
(connected l-4-7 l-3-7)
(connected l-3-7 l-3-8)
(connected l-3-8 l-3-7)
(connected l-3-8 l-4-8)
(connected l-4-8 l-3-8)
(connected l-3-8 l-3-9)
(connected l-3-9 l-3-8)
(connected l-3-9 l-4-9)
(connected l-4-9 l-3-9)
(connected l-4-1 l-5-1)
(connected l-5-1 l-4-1)
(connected l-4-1 l-4-2)
(connected l-4-2 l-4-1)
(connected l-4-2 l-5-2)
(connected l-5-2 l-4-2)
(connected l-4-2 l-4-3)
(connected l-4-3 l-4-2)
(connected l-4-3 l-5-3)
(connected l-5-3 l-4-3)
(connected l-4-3 l-4-4)
(connected l-4-4 l-4-3)
(connected l-4-4 l-5-4)
(connected l-5-4 l-4-4)
(connected l-4-4 l-4-5)
(connected l-4-5 l-4-4)
(connected l-4-5 l-5-5)
(connected l-5-5 l-4-5)
(connected l-4-5 l-4-6)
(connected l-4-6 l-4-5)
(connected l-4-6 l-5-6)
(connected l-5-6 l-4-6)
(connected l-4-6 l-4-7)
(connected l-4-7 l-4-6)
(connected l-4-7 l-5-7)
(connected l-5-7 l-4-7)
(connected l-4-7 l-4-8)
(connected l-4-8 l-4-7)
(connected l-4-8 l-5-8)
(connected l-5-8 l-4-8)
(connected l-4-8 l-4-9)
(connected l-4-9 l-4-8)
(connected l-4-9 l-5-9)
(connected l-5-9 l-4-9)
(connected l-5-1 l-6-1)
(connected l-6-1 l-5-1)
(connected l-5-1 l-5-2)
(connected l-5-2 l-5-1)
(connected l-5-2 l-6-2)
(connected l-6-2 l-5-2)
(connected l-5-2 l-5-3)
(connected l-5-3 l-5-2)
(connected l-5-3 l-6-3)
(connected l-6-3 l-5-3)
(connected l-5-3 l-5-4)
(connected l-5-4 l-5-3)
(connected l-5-4 l-6-4)
(connected l-6-4 l-5-4)
(connected l-5-4 l-5-5)
(connected l-5-5 l-5-4)
(connected l-5-5 l-6-5)
(connected l-6-5 l-5-5)
(connected l-5-5 l-5-6)
(connected l-5-6 l-5-5)
(connected l-5-6 l-6-6)
(connected l-6-6 l-5-6)
(connected l-5-6 l-5-7)
(connected l-5-7 l-5-6)
(connected l-5-7 l-6-7)
(connected l-6-7 l-5-7)
(connected l-5-7 l-5-8)
(connected l-5-8 l-5-7)
(connected l-5-8 l-6-8)
(connected l-6-8 l-5-8)
(connected l-5-8 l-5-9)
(connected l-5-9 l-5-8)
(connected l-5-9 l-6-9)
(connected l-6-9 l-5-9)
(connected l-6-1 l-7-1)
(connected l-7-1 l-6-1)
(connected l-6-1 l-6-2)
(connected l-6-2 l-6-1)
(connected l-6-2 l-7-2)
(connected l-7-2 l-6-2)
(connected l-6-2 l-6-3)
(connected l-6-3 l-6-2)
(connected l-6-3 l-7-3)
(connected l-7-3 l-6-3)
(connected l-6-3 l-6-4)
(connected l-6-4 l-6-3)
(connected l-6-4 l-7-4)
(connected l-7-4 l-6-4)
(connected l-6-4 l-6-5)
(connected l-6-5 l-6-4)
(connected l-6-5 l-7-5)
(connected l-7-5 l-6-5)
(connected l-6-5 l-6-6)
(connected l-6-6 l-6-5)
(connected l-6-6 l-7-6)
(connected l-7-6 l-6-6)
(connected l-6-6 l-6-7)
(connected l-6-7 l-6-6)
(connected l-6-7 l-7-7)
(connected l-7-7 l-6-7)
(connected l-6-7 l-6-8)
(connected l-6-8 l-6-7)
(connected l-6-8 l-7-8)
(connected l-7-8 l-6-8)
(connected l-6-8 l-6-9)
(connected l-6-9 l-6-8)
(connected l-6-9 l-7-9)
(connected l-7-9 l-6-9)
(connected l-7-1 l-8-1)
(connected l-8-1 l-7-1)
(connected l-7-1 l-7-2)
(connected l-7-2 l-7-1)
(connected l-7-2 l-8-2)
(connected l-8-2 l-7-2)
(connected l-7-2 l-7-3)
(connected l-7-3 l-7-2)
(connected l-7-3 l-8-3)
(connected l-8-3 l-7-3)
(connected l-7-3 l-7-4)
(connected l-7-4 l-7-3)
(connected l-7-4 l-8-4)
(connected l-8-4 l-7-4)
(connected l-7-4 l-7-5)
(connected l-7-5 l-7-4)
(connected l-7-5 l-8-5)
(connected l-8-5 l-7-5)
(connected l-7-5 l-7-6)
(connected l-7-6 l-7-5)
(connected l-7-6 l-8-6)
(connected l-8-6 l-7-6)
(connected l-7-6 l-7-7)
(connected l-7-7 l-7-6)
(connected l-7-7 l-8-7)
(connected l-8-7 l-7-7)
(connected l-7-7 l-7-8)
(connected l-7-8 l-7-7)
(connected l-7-8 l-8-8)
(connected l-8-8 l-7-8)
(connected l-7-8 l-7-9)
(connected l-7-9 l-7-8)
(connected l-7-9 l-8-9)
(connected l-8-9 l-7-9)
(connected l-8-1 l-9-1)
(connected l-9-1 l-8-1)
(connected l-8-1 l-8-2)
(connected l-8-2 l-8-1)
(connected l-8-2 l-9-2)
(connected l-9-2 l-8-2)
(connected l-8-2 l-8-3)
(connected l-8-3 l-8-2)
(connected l-8-3 l-9-3)
(connected l-9-3 l-8-3)
(connected l-8-3 l-8-4)
(connected l-8-4 l-8-3)
(connected l-8-4 l-9-4)
(connected l-9-4 l-8-4)
(connected l-8-4 l-8-5)
(connected l-8-5 l-8-4)
(connected l-8-5 l-9-5)
(connected l-9-5 l-8-5)
(connected l-8-5 l-8-6)
(connected l-8-6 l-8-5)
(connected l-8-6 l-9-6)
(connected l-9-6 l-8-6)
(connected l-8-6 l-8-7)
(connected l-8-7 l-8-6)
(connected l-8-7 l-9-7)
(connected l-9-7 l-8-7)
(connected l-8-7 l-8-8)
(connected l-8-8 l-8-7)
(connected l-8-8 l-9-8)
(connected l-9-8 l-8-8)
(connected l-8-8 l-8-9)
(connected l-8-9 l-8-8)
(connected l-8-9 l-9-9)
(connected l-9-9 l-8-9)
(connected l-9-1 l-9-2)
(connected l-9-2 l-9-1)
(connected l-9-2 l-9-3)
(connected l-9-3 l-9-2)
(connected l-9-3 l-9-4)
(connected l-9-4 l-9-3)
(connected l-9-4 l-9-5)
(connected l-9-5 l-9-4)
(connected l-9-5 l-9-6)
(connected l-9-6 l-9-5)
(connected l-9-6 l-9-7)
(connected l-9-7 l-9-6)
(connected l-9-7 l-9-8)
(connected l-9-8 l-9-7)
(connected l-9-8 l-9-9)
(connected l-9-9 l-9-8)

(accessible l-1-1)
(solid l-1-1)
(accessible l-1-2)
(medium l-1-2)
(accessible l-1-3)
(solid l-1-3)
(accessible l-1-4)
(small l-1-4)
(accessible l-1-5)
(solid l-1-5)
(accessible l-1-6)
(medium l-1-6)
(accessible l-1-7)
(solid l-1-7)
(accessible l-1-8)
(small l-1-8)
(accessible l-1-9)
(solid l-1-9)
(accessible l-2-1)
(big l-2-1)
(accessible l-2-2)
(small l-2-2)
(accessible l-2-3)
(small l-2-3)
(accessible l-2-4)
(medium l-2-4)
(accessible l-2-5)
(medium l-2-5)
(accessible l-2-6)
(small l-2-6)
(accessible l-2-7)
(small l-2-7)
(accessible l-2-8)
(medium l-2-8)
(accessible l-2-9)
(medium l-2-9)
(accessible l-3-1)
(solid l-3-1)
(accessible l-3-2)
(small l-3-2)
(accessible l-3-3)
(solid l-3-3)
(accessible l-3-4)
(big l-3-4)
(accessible l-3-5)
(solid l-3-5)
(accessible l-3-6)
(small l-3-6)
(accessible l-3-7)
(solid l-3-7)
(accessible l-3-8)
(big l-3-8)
(accessible l-3-9)
(solid l-3-9)
(accessible l-4-1)
(small l-4-1)
(accessible l-4-2)
(big l-4-2)
(accessible l-4-3)
(big l-4-3)
(accessible l-4-4)
(medium l-4-4)
(accessible l-4-5)
(small l-4-5)
(accessible l-4-6)
(big l-4-6)
(accessible l-4-7)
(big l-4-7)
(accessible l-4-8)
(medium l-4-8)
(accessible l-4-9)
(small l-4-9)
(accessible l-5-1)
(solid l-5-1)
(accessible l-5-2)
(medium l-5-2)
(accessible l-5-3)
(solid l-5-3)
(accessible l-5-4)
(small l-5-4)
(accessible l-5-5)
(solid l-5-5)
(accessible l-5-6)
(medium l-5-6)
(accessible l-5-7)
(solid l-5-7)
(accessible l-5-8)
(small l-5-8)
(accessible l-5-9)
(solid l-5-9)

(accessible l-6-1)
(big l-6-1)
(accessible l-6-2)
(small l-6-2)
(accessible l-6-3)
(small l-6-3)
(accessible l-6-4)
(medium l-6-4)
(accessible l-6-5)
(medium l-6-5)
(accessible l-6-6)
(small l-6-6)
(accessible l-6-7)
(small l-6-7)
(accessible l-6-8)
(medium l-6-8)
(accessible l-6-9)
(medium l-6-9)
(accessible l-7-1)
(solid l-7-1)
(accessible l-7-2)
(small l-7-2)
(accessible l-7-3)
(solid l-7-3)
(accessible l-7-4)
(big l-7-4)
(accessible l-7-5)
(solid l-7-5)
(accessible l-7-6)
(small l-7-6)
(accessible l-7-7)
(solid l-7-7)
(accessible l-7-8)
(big l-7-8)
(accessible l-7-9)
(solid l-7-9)
(accessible l-8-1)
(small l-8-1)
(accessible l-8-2)
(big l-8-2)
(accessible l-8-3)
(big l-8-3)
(accessible l-8-4)
(medium l-8-4)
(accessible l-8-5)
(small l-8-5)
(accessible l-8-6)
(big l-8-6)
(accessible l-8-7)
(big l-8-7)
(accessible l-8-8)
(medium l-8-8)
(accessible l-8-9)
(small l-8-9)
(accessible l-9-1)
(solid l-9-1)
(accessible l-9-2)
(medium l-9-2)
(accessible l-9-3)
(solid l-9-3)
(accessible l-9-4)
(small l-9-4)
(accessible l-9-5)
(solid l-9-5)
(accessible l-9-6)
(medium l-9-6)
(accessible l-9-7)
(solid l-9-7)
(accessible l-9-8)
(small l-9-8)
(accessible l-9-9)
(solid l-9-9)

)

(:goal (and (alive)
            (taken r1)
            (taken r2)
            (taken r3)
            (taken r4)
            (taken r5)
            (taken r6)
            (taken r7)
            (taken r8)
            (taken r9)
            (taken r10)
            (taken r11)
            (taken r12)
            (taken r13)
            (taken r14)
            (taken r15)
            (taken r16)
            (taken r17)
            (taken r18)
            (taken r19)
            (taken r20)
            (taken r21)
            (taken r22)
            (taken r23)
            (taken r24)

       )
)
)

; plan
1. (move l-1-1 l-1-2)
   deleted: (at-agent l-1-1)
   added: (at-agent l-1-2)
   goals met: 1 of 25
2. (move l-1-2 l-1-3)
   deleted: (at-agent l-1-2)
   added: (at-agent l-1-3)
   goals met: 1 of 25
3. (collect r1 l-1-3)
   added: (taken r1)
   goals met: 2 of 25
4. (move l-1-3 l-1-4)
   deleted: (at-agent l-1-3)
   added: (at-agent l-1-4)
   goals met: 2 of 25
5. (move l-1-4 l-1-5)
   deleted: (at-agent l-1-4)
   added: (at-agent l-1-5)
   goals met: 2 of 25
6. (collect r2 l-1-5)
   added: (taken r2)
   goals met: 3 of 25
7. (move l-1-5 l-1-6)
   deleted: (at-agent l-1-5)
   added: (at-agent l-1-6)
   goals met: 3 of 25
8. (move l-1-6 l-1-7)
   deleted: (at-agent l-1-6)
   added: (at-agent l-1-7)
   goals met: 3 of 25
9. (collect r3 l-1-7)
   added: (taken r3)
   goals met: 4 of 25
10. (move l-1-7 l-2-7)
   deleted: (at-agent l-1-7)
   added: (at-agent l-2-7)
   goals met: 4 of 25
11. (move l-2-7 l-3-7)
   deleted: (at-agent l-2-7)
   added: (at-agent l-3-7)
   goals met: 4 of 25
12. (collect r8 l-3-7)
   added: (taken r8)
   goals met: 5 of 25
13. (move l-3-7 l-3-6)
   deleted: (at-agent l-3-7)
   added: (at-agent l-3-6)
   goals met: 5 of 25
14. (move l-3-6 l-3-5)
   deleted: (at-agent l-3-6)
   added: (at-agent l-3-5)
   goals met: 5 of 25
15. (collect r7 l-3-5)
   added: (taken r7)
   goals met: 6 of 25
16. (move l-3-5 l-3-4)
   deleted: (at-agent l-3-5)
   added: (at-agent l-3-4)
   goals met: 6 of 25
17. (move l-3-4 l-3-3)
   deleted: (at-agent l-3-4)
   added: (at-agent l-3-3)
   goals met: 6 of 25
18. (collect r6 l-3-3)
   added: (taken r6)
   goals met: 7 of 25
19. (move l-3-3 l-3-2)
   deleted: (at-agent l-3-3)
   added: (at-agent l-3-2)
   goals met: 7 of 25
20. (move l-3-2 l-3-1)
   deleted: (at-agent l-3-2)
   added: (at-agent l-3-1)
   goals met: 7 of 25
21. (collect r5 l-3-1)
   added: (taken r5)
   goals met: 8 of 25
22. (move l-3-1 l-4-1)
   deleted: (at-agent l-3-1)
   added: (at-agent l-4-1)
   goals met: 8 of 25
23. (move l-4-1 l-5-1)
   deleted: (at-agent l-4-1)
   added: (at-agent l-5-1)
   goals met: 8 of 25
24. (collect r10 l-5-1)
   added: (taken r10)
   goals met: 9 of 25
25. (move l-5-1 l-5-2)
   deleted: (at-agent l-5-1)
   added: (at-agent l-5-2)
   goals met: 9 of 25
26. (move l-5-2 l-5-3)
   deleted: (at-agent l-5-2)
   added: (at-agent l-5-3)
   goals met: 9 of 25
27. (collect r11 l-5-3)
   added: (taken r11)
   goals met: 10 of 25
28. (move l-5-3 l-6-3)
   deleted: (at-agent l-5-3)
   added: (at-agent l-6-3)
   goals met: 10 of 25
29. (move l-6-3 l-7-3)
   deleted: (at-agent l-6-3)
   added: (at-agent l-7-3)
   goals met: 10 of 25
30. (collect r16 l-7-3)
   added: (taken r16)
   goals met: 11 of 25
31. (move l-7-3 l-7-2)
   deleted: (at-agent l-7-3)
   added: (at-agent l-7-2)
   goals met: 11 of 25
32. (move l-7-2 l-7-1)
   deleted: (at-agent l-7-2)
   added: (at-agent l-7-1)
   goals met: 11 of 25
33. (collect r15 l-7-1)
   added: (taken r15)
   goals met: 12 of 25
34. (move l-7-1 l-8-1)
   deleted: (at-agent l-7-1)
   added: (at-agent l-8-1)
   goals met: 12 of 25
35. (move l-8-1 l-9-1)
   deleted: (at-agent l-8-1)
   added: (at-agent l-9-1)
   goals met: 12 of 25
36. (collect r20 l-9-1)
   added: (taken r20)
   goals met: 13 of 25
37. (move l-9-1 l-9-2)
   deleted: (at-agent l-9-1)
   added: (at-agent l-9-2)
   goals met: 13 of 25
38. (move l-9-2 l-9-3)
   deleted: (at-agent l-9-2)
   added: (at-agent l-9-3)
   goals met: 13 of 25
39. (collect r21 l-9-3)
   added: (taken r21)
   goals met: 14 of 25
40. (move l-9-3 l-9-4)
   deleted: (at-agent l-9-3)
   added: (at-agent l-9-4)
   goals met: 14 of 25
41. (move l-9-4 l-9-5)
   deleted: (at-agent l-9-4)
   added: (at-agent l-9-5)
   goals met: 14 of 25
42. (collect r22 l-9-5)
   added: (taken r22)
   goals met: 15 of 25
43. (move l-9-5 l-8-5)
   deleted: (at-agent l-9-5)
   added: (at-agent l-8-5)
   goals met: 15 of 25
44. (move l-8-5 l-7-5)
   deleted: (at-agent l-8-5)
   added: (at-agent l-7-5)
   goals met: 15 of 25
45. (collect r17 l-7-5)
   added: (taken r17)
   goals met: 16 of 25
46. (move l-7-5 l-7-6)
   deleted: (at-agent l-7-5)
   added: (at-agent l-7-6)
   goals met: 16 of 25
47. (move l-7-6 l-7-7)
   deleted: (at-agent l-7-6)
   added: (at-agent l-7-7)
   goals met: 16 of 25
48. (collect r18 l-7-7)
   added: (taken r18)
   goals met: 17 of 25
49. (move l-7-7 l-6-7)
   deleted: (at-agent l-7-7)
   added: (at-agent l-6-7)
   goals met: 17 of 25
50. (move l-6-7 l-5-7)
   deleted: (at-agent l-6-7)
   added: (at-agent l-5-7)
   goals met: 17 of 25
51. (collect r13 l-5-7)
   added: (taken r13)
   goals met: 18 of 25
52. (move l-5-7 l-5-8)
   deleted: (at-agent l-5-7)
   added: (at-agent l-5-8)
   goals met: 18 of 25
53. (move l-5-8 l-5-9)
   deleted: (at-agent l-5-8)
   added: (at-agent l-5-9)
   goals met: 18 of 25
54. (collect r14 l-5-9)
   added: (taken r14)
   goals met: 19 of 25
55. (move l-5-9 l-4-9)
   deleted: (at-agent l-5-9)
   added: (at-agent l-4-9)
   goals met: 19 of 25
56. (move l-4-9 l-3-9)
   deleted: (at-agent l-4-9)
   added: (at-agent l-3-9)
   goals met: 19 of 25
57. (collect r9 l-3-9)
   added: (taken r9)
   goals met: 20 of 25
58. (move l-3-9 l-2-9)
   deleted: (at-agent l-3-9)
   added: (at-agent l-2-9)
   goals met: 20 of 25
59. (move l-2-9 l-1-9)
   deleted: (at-agent l-2-9)
   added: (at-agent l-1-9)
   goals met: 20 of 25
60. (collect r4 l-1-9)
   added: (taken r4)
   goals met: 21 of 25
61. (move l-1-9 l-2-9)
   deleted: (at-agent l-1-9)
   added: (at-agent l-2-9)
   goals met: 21 of 25
62. (move l-2-9 l-2-8)
   deleted: (at-agent l-2-9)
   added: (at-agent l-2-8)
   goals met: 21 of 25
63. (move l-2-8 l-3-8)
   deleted: (at-agent l-2-8)
   added: (at-agent l-3-8)
   goals met: 21 of 25
64. (move l-3-8 l-4-8)
   deleted: (at-agent l-3-8)
   added: (at-agent l-4-8)
   goals met: 21 of 25
65. (move l-4-8 l-5-8)
   deleted: (at-agent l-4-8)
   added: (at-agent l-5-8)
   goals met: 21 of 25
66. (move l-5-8 l-6-8)
   deleted: (at-agent l-5-8)
   added: (at-agent l-6-8)
   goals met: 21 of 25
67. (move l-6-8 l-7-8)
   deleted: (at-agent l-6-8)
   added: (at-agent l-7-8)
   goals met: 21 of 25
68. (move l-7-8 l-7-9)
   deleted: (at-agent l-7-8)
   added: (at-agent l-7-9)
   goals met: 21 of 25
69. (collect r19 l-7-9)
   added: (taken r19)
   goals met: 22 of 25
70. (move l-7-9 l-8-9)
   deleted: (at-agent l-7-9)
   added: (at-agent l-8-9)
   goals met: 22 of 25
71. (move l-8-9 l-9-9)
   deleted: (at-agent l-8-9)
   added: (at-agent l-9-9)
   goals met: 22 of 25
72. (collect r24 l-9-9)
   added: (taken r24)
   goals met: 23 of 25
73. (move l-9-9 l-9-8)
   deleted: (at-agent l-9-9)
   added: (at-agent l-9-8)
   goals met: 23 of 25
74. (move l-9-8 l-9-7)
   deleted: (at-agent l-9-8)
   added: (at-agent l-9-7)
   goals met: 23 of 25
75. (collect r23 l-9-7)
   added: (taken r23)
   goals met: 24 of 25
76. (move l-9-7 l-8-7)
   deleted: (at-agent l-9-7)
   added: (at-agent l-8-7)
   goals met: 24 of 25
77. (move l-8-7 l-7-7)
   deleted: (at-agent l-8-7)
   added: (at-agent l-7-7)
   goals met: 24 of 25
78. (move l-7-7 l-7-6)
   deleted: (at-agent l-7-7)
   added: (at-agent l-7-6)
   goals met: 24 of 25
79. (move l-7-6 l-6-6)
   deleted: (at-agent l-7-6)
   added: (at-agent l-6-6)
   goals met: 24 of 25
80. (move l-6-6 l-6-5)
   deleted: (at-agent l-6-6)
   added: (at-agent l-6-5)
   goals met: 24 of 25
81. (move l-6-5 l-5-5)
   deleted: (at-agent l-6-5)
   added: (at-agent l-5-5)
   goals met: 24 of 25
82. (collect r12 l-5-5)
   added: (taken r12)
   goals met: 25 of 25
